In [1]:
#import packages
import numpy as np
import pandas as pd

In [2]:
#load data or create dataframe
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
#assign df value to df1
df1=df

In [4]:
#display top rows for 
df1.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [5]:
#information of df1 dataframe
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   From_To       5 non-null      object
 1   FlightNumber  3 non-null      float64
 2   RecentDelays  5 non-null      object
 3   Airline       5 non-null      object
dtypes: float64(1), object(3)
memory usage: 288.0+ bytes

1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put inplace. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [6]:
#to get null value in form of true & false format
df_isnull=df['FlightNumber'].isnull()
df_isnull

0    False
1     True
2    False
3     True
4    False
Name: FlightNumber, dtype: bool

In [7]:
#to fill the null value using method=ffill
df1['FlightNumber'].fillna(method='ffill',inplace=True)

In [8]:
#zip the df_isnull & df1.index
x=zip(df_isnull,df1.index);
print(x)

<zip object at 0x00000239ACE1CC08>

In [9]:
#update the df['FlightNumber'] with 10 only nan updateded values
for i in x:
    if i[0] == True:
        print(i,i[0],i[1])
        df1['FlightNumber'].iloc[i[1]]= df1['FlightNumber'].iloc[i[1]]+10
df1

(True, 1) True 1
(True, 3) True 3

C:\Users\Murali\anaconda3\lib\site-packages\pandas\core\indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [10]:
#.to_numeric
df1['FlightNumber']=pd.to_numeric(df1['FlightNumber'], downcast='integer')

#Astype convert  with example
#df['FlightNumber'].astype(float)

In [11]:
df1.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [12]:
# split the column based on separator and expand (expand dimensions)
df_split=df1['From_To'].str.split("_",n=1,expand=True)
df_split.head()

          0          1
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [13]:
#assign new column to df from splitted dataframe df_split based on inxde like below 
df1['From']=df_split[0]
df1['To']=df_split[1]

In [14]:
df1

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [15]:
#Change the alhp with upper case
df1['From']=df['From'].str.upper()
df['From']

0      LONDON
1      MADRID
2      LONDON
3    BUDAPEST
4    BRUSSELS
Name: From, dtype: object

In [ ]:
4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [16]:
#remove  columns from 
df1.drop(columns='From_To',inplace=True)
df1.head()

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    LONDON      paris
1         10055            []    <Air France> (12)    MADRID      miLAN
2         10065  [24, 43, 87]  (British Airways. )    LONDON  StockhOlm
3         10075          [13]       12. Air France  BUDAPEST      PaRis
4         10085      [67, 32]          "Swiss Air"  BRUSSELS     londOn

In [17]:
#info of df1 dataframe
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   FlightNumber  5 non-null      int16
 1   RecentDelays  5 non-null      object
 2   Airline       5 non-null      object
 3   From          5 non-null      object
 4   To            5 non-null      object
dtypes: int16(1), object(4)
memory usage: 298.0+ bytes

5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN. Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [18]:
df_RecentDelays_split=df1['RecentDelays'].apply(pd.Series)
df_RecentDelays_split

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [19]:
#reanme the column with required column nnames
df_RecentDelays_split=df_RecentDelays_split.rename(columns = lambda x : 'delay_' + str(x))
df_RecentDelays_split

   delay_0  delay_1  delay_2
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [20]:
#join dataframes
df1.join(df_RecentDelays_split)

#with using Concat 
#df1=pd.concat(df1[:],df1_df_RecentDelays_split,axis=1)

,FlightNumber,RecentDelays,Airline,From,To,delay_0,delay_1,delay_2
0,10045,"[23, 47]",KLM(!),LONDON,paris,23.0,47.0,NaN
1,10055,[],<Air France> (12),MADRID,miLAN,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),LONDON,StockhOlm,24.0,43.0,87.0
3,10075,[13],12. Air France,BUDAPEST,PaRis,13.0,NaN,NaN
4,10085,"[67, 32]","""Swiss Air""",BRUSSELS,londOn,67.0,32.0,NaN

In [21]:
#based on requirment drop the RecentDelays
df1.drop(columns='RecentDelays')

   FlightNumber              Airline      From         To
0         10045               KLM(!)    LONDON      paris
1         10055    <Air France> (12)    MADRID      miLAN
2         10065  (British Airways. )    LONDON  StockhOlm
3         10075       12. Air France  BUDAPEST      PaRis
4         10085          "Swiss Air"  BRUSSELS     londOn